@echo off
echo ========================================================
echo 正在安装/检查依赖库，请稍候... (首次运行可能需要几分钟)
echo ========================================================
pip install -r requirements.txt -i https://pypi.tuna.tsinghua.edu.cn/simple

echo.
echo ========================================================
echo 正在生成数据...
echo ========================================================
python 01_generate_data.py

echo.
echo ========================================================
echo 正在启动系统，请留意自动弹出的浏览器页面...
echo ========================================================
streamlit run 03_app.py

pause